app/views/recipes/show.html.erb

<h1>Cooking Utensils Requirement</h1>
<h4><% @recipe.utensils.each do |utensil|%>
---
SELECT "utensils".* FROM "utensils" INNER JOIN "recipe_utensils" ON "utensils"."id" = "recipe_utensils"."utensil_id" WHERE "recipe_utensils"."recipe_id" = ?  [["recipe_id", 2]]

<h1>Ingredients Required</h1>
<h4><% @recipe.ingredients.each do |ingredient|%>
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ?  [["recipe_id", 2]]