app/views/users/show.html.erb


<% @user.recipes.each do |recipe|%>
---
SELECT "recipes".* FROM "recipes" INNER JOIN "reviews" ON "recipes"."id" = "reviews"."recipe_id" WHERE "reviews"."user_id" = ?  [["user_id", 4]]