app/controllers/application_controller.rb

    def current_user
        if session[:user_id]
            @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]