app/controllers/ingredients_controller.rb

  def show
    @ingredient = Ingredient.find(params[:id])
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

def create
  @ingredient= Ingredient.new(ingredient_params)

  if @ingredient.valid?
      @ingredient.save
---
INSERT INTO "ingredients" ("name", "quantity", "measurement_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Salt"], ["quantity", 1], ["measurement_type", "Teaspoon"], ["created_at", "2019-10-22 15:39:12.584360"], ["updated_at", "2019-10-22 15:39:12.584360"]]

  def edit
    @ingredient = Ingredient.find(params[:id])
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @ingredient = Ingredient.find(params[:id])
    @ingredient.update(ingredient_params)
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
UPDATE "ingredients" SET "name" = ?, "updated_at" = ? WHERE "ingredients"."id" = ?  [["name", "rooff"], ["updated_at", "2019-10-24 20:20:55.951675"], ["id", 21]]

def destroy
  @ingredient = Ingredient.find(params[:id])
  @ingredient.destroy
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 1]]

def uniq_ingredients
  @ingredients = Ingredient.all
  @ingredient_arr = []
    @ingredients.each do |ingredient|
---
SELECT "ingredients".* FROM "ingredients"