app/controllers/recipes_controller.rb

  def show
    @review = Review.new
    total_rate = 0.0
    @recipe.reviews.each do |i|
      total_rate += i.rating
    end
    @avg_rate = (total_rate/@recipe.reviews.count).round(2)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."recipe_id" = ?  [["recipe_id", 1]]

  def create
    @user_id = session[:user_id]
    @recipe = Recipe.new(recipe_params)


  if params[:add_ingredient]
      @recipe.ingredients.build
    elsif params[:remove_ingredient]

    elsif params[:add_utensil]
        @recipe.utensils.build
    elsif params[:remove_utensil]

    else
      if @recipe.valid? == false
        flash[:errors] = @recipe.errors.full_messages
      end
      # at this point its saved
      #now onto the ifstatement
      if @recipe.save
---
INSERT INTO "ingredients" ("name", "quantity", "measurement_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "water"], ["quantity", 1], ["measurement_type", "cup"], ["created_at", "2019-10-25 19:36:48.851709"], ["updated_at", "2019-10-25 19:36:48.851709"]]
INSERT INTO "recipe_ingredients" ("recipe_id", "ingredient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["recipe_id", 10], ["ingredient_id", 21], ["created_at", "2019-10-25 19:36:48.861563"], ["updated_at", "2019-10-25 19:36:48.861563"]]
INSERT INTO "recipe_utensils" ("recipe_id", "utensil_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["recipe_id", 10], ["utensil_id", 19], ["created_at", "2019-10-25 19:36:48.878739"], ["updated_at", "2019-10-25 19:36:48.878739"]]
INSERT INTO "recipes" ("title", "description", "user_id", "cook_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Mac n Cheese"], ["description", "lots of cheese"], ["user_id", 6], ["cook_time", 10], ["created_at", "2019-10-25 19:36:48.846681"], ["updated_at", "2019-10-25 19:36:48.846681"]]

  def update
    @user_id = session[:user_id]

    if params[:add_ingredient]
    	# rebuild the ingredient attributes that doesn't have an id
    	unless recipe_params[:ingredients_attributes].blank?
	      for attribute in recipe_params[:ingredients_attributes]
	        @recipe.ingredients.build(attribute.last.except(:_destroy)) unless attribute.last.has_key?(:id)
	      end
    	end
      # add one more empty ingredient attribute
      @recipe.ingredients.build
    elsif params[:remove_ingredient]
      # collect all marked for delete ingredient ids
      removed_ingredients = recipe_params[:ingredients_attributes].to_hash.collect { |i, att| att['id'] if (att['id'] && att[:_destroy].to_i == 1) }
      # physically delete the ingredients from database
      Ingredient.delete(removed_ingredients)
      flash[:notice] = "Ingredients removed."
      for attribute in recipe_params[:ingredients_attributes]
      	# rebuild ingredients attributes that doesn't have an id and its _destroy attribute is not 1
        @recipe.ingredients.build(attribute.last.except(:_destroy)) if (!attribute.last.has_key?(:id) && attribute.last[:_destroy].to_i == 0)
      end

    elsif params[:add_utensil]
        unless recipe_params[:utensils_attributes].blank?
          for attribute in recipe_params[:utensils_attributes]
            @recipe.utensils.build(attribute.last.except(:_destroy)) unless attribute.last.has_key?(:id)
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ? AND "ingredients"."id" IN (?, ?)  [["recipe_id", 6], ["id", 13], ["id", 14]]
DELETE FROM "ingredients" WHERE "ingredients"."id" IS NULL
SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ? AND "ingredients"."id" IN (?, ?, ?)  [["recipe_id", 3], ["id", 4], ["id", 5], ["id", 6]]
SELECT "utensils".* FROM "utensils" INNER JOIN "recipe_utensils" ON "utensils"."id" = "recipe_utensils"."utensil_id" WHERE "recipe_utensils"."recipe_id" = ? AND "utensils"."id" IN (?, ?)  [["recipe_id", 7], ["id", 9], ["id", 10]]
SELECT "ingredients".* FROM "ingredients" INNER JOIN "recipe_ingredients" ON "ingredients"."id" = "recipe_ingredients"."ingredient_id" WHERE "recipe_ingredients"."recipe_id" = ? AND "ingredients"."id" IN (?, ?)  [["recipe_id", 3], ["id", 4], ["id", 6]]

        # collect all marked for delete ingredient ids
        removed_utensils = recipe_params[:utensils_attributes].to_hash.collect { |i, att| att['id'] if (att['id'] && att[:_destroy].to_i == 1) }
        # physically delete the ingredients from database
        Utensil.delete(removed_utensils)
        flash[:notice] = "Utensils removed."
        for attribute in recipe_params[:utensils_attributes]
          # rebuild ingredients attributes that doesn't have an id and its _destroy attribute is not 1
          @recipe.utensils.build(attribute.last.except(:_destroy)) if (!attribute.last.has_key?(:id) && attribute.last[:_destroy].to_i == 0)
        end
    else
      # save
      if @recipe.update_attributes(recipe_params)
---
DELETE FROM "utensils" WHERE "utensils"."id" IS NULL
SELECT "utensils".* FROM "utensils" INNER JOIN "recipe_utensils" ON "utensils"."id" = "recipe_utensils"."utensil_id" WHERE "recipe_utensils"."recipe_id" = ? AND "utensils"."id" IN (?, ?, ?)  [["recipe_id", 3], ["id", 4], ["id", 5], ["id", 6]]
UPDATE "recipes" SET "cook_time" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["cook_time", 20], ["updated_at", "2019-10-25 19:37:23.296650"], ["id", 10]]

  def current_recipe
    @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]