app/controllers/recipes_controller.rb

  def create
    @user_id = session[:user_id]

    @recipe = Recipe.create(recipe_params)
---
INSERT INTO "recipes" ("title", "description", "user_id", "cook_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "pizza"], ["description", "somethingnew"], ["user_id", 1], ["cook_time", 20], ["created_at", "2019-10-22 22:15:15.028257"], ["updated_at", "2019-10-22 22:15:15.028257"]]

  def update
    @user_id = session[:user_id]
    @recipe.update(recipe_params)
---
UPDATE "recipes" SET "title" = ?, "user_id" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["title", "Brea"], ["user_id", 1], ["updated_at", "2019-10-22 22:28:52.104490"], ["id", 2]]

  def current_recipe
    @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]