app/controllers/recipes_controller.rb

  def current_recipe
    @recipe = Recipe.find(params[:id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]