app/controllers/reviews_controller.rb

SELECT "recipes".* FROM "recipes"
---
  def new
    @review = Review.new
    @recipes = Recipe.all

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
INSERT INTO "reviews" ("rating", "comment", "user_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 1], ["comment", "erhege"], ["user_id", 7], ["recipe_id", 19], ["created_at", "2019-10-25 18:26:20.767743"], ["updated_at", "2019-10-25 18:26:20.767743"]]
---
  def create
    @user_id = session[:user_id]
    @review = Review.new(review_params)
    @recipe = Recipe.find(params[:review][:recipe_id])

    if @review.valid?
      @review.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes"
---
  def edit
    @review = Review.find(params[:id])
    @recipes = Recipe.all

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 1], ["updated_at", "2019-10-22 22:23:36.894110"], ["id", 4]]
---
  def update
    @user_id = session[:user_id]
    @review = Review.find(params[:id])
    @review.update(review_params)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def destroy
    @review = Review.find(params[:id])