app/controllers/users_controller.rb

    def create
    @user = User.new(user_params)

        if @user.valid?
            @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "jack"], ["password_digest", "$2a$10$mBx3tOhHE6wkF/MxdI3XlOht7eNhbx3zo7xwEtd8VO1ORnLqIyWqS"], ["created_at", "2019-10-24 15:34:55.735853"], ["updated_at", "2019-10-24 15:34:55.735853"]]

    def show
        @user = User.find(session[:user_id])
        @recipes = Recipe.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 1]]