app/controllers/utensils_controller.rb

  def index

    @utensils = Utensil.all
---
SELECT "utensils".* FROM "utensils"

  def show
    @utensil = Utensil.find(params[:id])
---
SELECT "utensils".* FROM "utensils" WHERE "utensils"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

def create
  @utensil = Utensil.new(utensil_params)

  if @utensil.valid?
      @utensil.save
---
INSERT INTO "utensils" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ""], ["created_at", "2019-10-21 22:42:21.838534"], ["updated_at", "2019-10-21 22:42:21.838534"]]

  def edit
    @utensil = Utensil.find(params[:id])
---
SELECT "utensils".* FROM "utensils" WHERE "utensils"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    @utensil = Utensil.find(params[:id])
    @utensil.update(utensil_params)
---
SELECT "utensils".* FROM "utensils" WHERE "utensils"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "utensils" SET "name" = ?, "updated_at" = ? WHERE "utensils"."id" = ?  [["name", "Spoon"], ["updated_at", "2019-10-21 22:56:50.722081"], ["id", 3]]

def destroy
  @utensil = Utensil.find(params[:id])
  @utensil.destroy
---
SELECT "utensils".* FROM "utensils" WHERE "utensils"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "utensils" WHERE "utensils"."id" = ?  [["id", 4]]